Revit 2027 API
RebarInSystem.RebarShapeId Property
 The RebarShape element that defines the shape of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RebarShapeId { get; }
Public ReadOnly Property RebarShapeId As ElementId
	Get
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
}
member RebarShapeId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace